tiborsimon/embedded-tdd-headers/pic/8bit/pic12f1822_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12F1822_H_
#define _PIC12F1822_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define PORTA_MDOUT                   36
#define C1INP                         37
#define AN0                           38
#define DACOUT                        39
#define RA0                           40
#define CPS0                          41
#define AN1                           42
#define SCL                           43
#define SRI                           44
#define RA1                           45
#define MDMIN                         46
#define SCK                           47
#define C1IN0N                        48
#define CPS1                          49
#define AN2                           50
#define SDI                           51
#define PORTA_C1OUT                   52
#define FLT0                          53
#define T0CKI                         54
#define SRQ                           55
#define RA2                           56
#define SDA                           57
#define MDCIN1                        58
#define CPS2                          59
#define RA3                           60
#define nMCLR                         61
#define CLKOUT                        62
#define AN3                           63
#define CLKR                          64
#define C1IN1N                        65
#define MDCIN2                        66
#define T1OSO                         67
#define RA4                           68
#define OSC2                          69
#define CPS3                          70
#define CLKIN                         71
#define T1CKI                         72
#define T1OSI                         73
#define OSC1                          74
#define RA5                           75
#define SRNQ                          76
#define PIR1                          77
#define TMR1IF                        78
#define TMR2IF                        79
#define CCP1IF                        80
#define SSP1IF                        81
#define TXIF                          82
#define RCIF                          83
#define ADIF                          84
#define TMR1GIF                       85
#define PIR2                          86
#define BCL1IF                        87
#define EEIF                          88
#define C1IF                          89
#define OSFIF                         90
#define TMR0                          91
#define TMR1L                         92
#define TMR1H                         93
#define T1CON                         94
#define TMR1ON                        95
#define nT1SYNC                       96
#define T1OSCEN                       97
#define T1CKPS0                       98
#define T1CKPS                        99
#define T1CKPS1                       100
#define TMR1CS                        101
#define TMR1CS0                       102
#define TMR1CS1                       103
#define T1GCON                        104
#define T1GSS0                        105
#define T1GSS                         106
#define T1GSS1                        107
#define T1GVAL                        108
#define T1GGO_nDONE                   109
#define T1GGO                         110
#define T1GSPM                        111
#define T1GTM                         112
#define T1GPOL                        113
#define TMR1GE                        114
#define TMR2                          115
#define PR2                           116
#define T2CON                         117
#define T2CKPS0                       118
#define T2CKPS                        119
#define T2CKPS1                       120
#define TMR2ON                        121
#define T2OUTPS0                      122
#define T2OUTPS                       123
#define T2OUTPS1                      124
#define T2OUTPS2                      125
#define T2OUTPS3                      126
#define CPSCON0                       127
#define T0XCS                         128
#define CPSOUT                        129
#define CPSRNG                        130
#define CPSRNG0                       131
#define CPSRNG1                       132
#define CPSRM                         133
#define CPSON                         134
#define CPSCON1                       135
#define CPSCH                         136
#define CPSCH0                        137
#define CPSCH1                        138
#define TRISA                         139
#define TRISA0                        140
#define TRISA1                        141
#define TRISA2                        142
#define TRISA3                        143
#define TRISA4                        144
#define TRISA5                        145
#define PIE1                          146
#define TMR1IE                        147
#define TMR2IE                        148
#define CCP1IE                        149
#define SSP1IE                        150
#define TXIE                          151
#define RCIE                          152
#define ADIE                          153
#define TMR1GIE                       154
#define PIE2                          155
#define BCL1IE                        156
#define EEIE                          157
#define C1IE                          158
#define OSFIE                         159
#define OPTION_REG                    160
#define PS                            161
#define PS0                           162
#define PS1                           163
#define PS2                           164
#define PSA                           165
#define T0SE                          166
#define TMR0SE                        167
#define T0CS                          168
#define TMR0CS                        169
#define INTEDG                        170
#define nWPUEN                        171
#define PCON                          172
#define nBOR                          173
#define nPOR                          174
#define nRI                           175
#define nRMCLR                        176
#define STKUNF                        177
#define STKOVF                        178
#define WDTCON                        179
#define SWDTEN                        180
#define WDTPS                         181
#define WDTPS0                        182
#define WDTPS1                        183
#define WDTPS2                        184
#define WDTPS3                        185
#define WDTPS4                        186
#define OSCTUNE                       187
#define TUN0                          188
#define TUN                           189
#define TUN1                          190
#define TUN2                          191
#define TUN3                          192
#define TUN4                          193
#define TUN5                          194
#define OSCCON                        195
#define SCS0                          196
#define SCS                           197
#define SCS1                          198
#define IRCF                          199
#define IRCF0                         200
#define IRCF1                         201
#define IRCF2                         202
#define IRCF3                         203
#define SPLLEN                        204
#define OSCSTAT                       205
#define HFIOFS                        206
#define LFIOFR                        207
#define MFIOFR                        208
#define HFIOFL                        209
#define HFIOFR                        210
#define OSTS                          211
#define PLLR                          212
#define T1OSCR                        213
#define ADRESL                        214
#define ADRESH                        215
#define ADCON0                        216
#define ADON                          217
#define nDONE                         218
#define GO_nDONE                      219
#define GO                            220
#define ADGO                          221
#define CHS0                          222
#define CHS                           223
#define CHS1                          224
#define CHS2                          225
#define CHS3                          226
#define CHS4                          227
#define ADCON1                        228
#define ADPREF0                       229
#define ADPREF                        230
#define ADPREF1                       231
#define ADCS0                         232
#define ADCS                          233
#define ADCS1                         234
#define ADCS2                         235
#define ADFM                          236
#define LATA                          237
#define LATA0                         238
#define LATA1                         239
#define LATA2                         240
#define LATA4                         241
#define LATA5                         242
#define CM1CON0                       243
#define C1SYNC                        244
#define C1HYS                         245
#define C1SP                          246
#define C1POL                         247
#define C1OE                          248
#define CM1CON0_C1OUT                 249
#define C1ON                          250
#define CM1CON1                       251
#define C1NCH0                        252
#define C1PCH                         253
#define C1PCH0                        254
#define C1PCH1                        255
#define C1INTN                        256
#define C1INTP                        257
#define CMOUT                         258
#define MC1OUT                        259
#define BORCON                        260
#define BORRDY                        261
#define SBOREN                        262
#define FVRCON                        263
#define ADFVR0                        264
#define ADFVR                         265
#define ADFVR1                        266
#define CDAFVR0                       267
#define CDAFVR                        268
#define CDAFVR1                       269
#define TSRNG                         270
#define TSEN                          271
#define FVRRDY                        272
#define FVREN                         273
#define DACCON0                       274
#define DACPSS                        275
#define DACPSS0                       276
#define DACPSS1                       277
#define DACOE                         278
#define DACLPS                        279
#define DACEN                         280
#define DACCON1                       281
#define DACR0                         282
#define DACR                          283
#define DACR1                         284
#define DACR2                         285
#define DACR3                         286
#define DACR4                         287
#define SRCON0                        288
#define SRPR                          289
#define SRPS                          290
#define SRNQEN                        291
#define SRQEN                         292
#define SRCLK0                        293
#define SRCLK                         294
#define SRCLK1                        295
#define SRCLK2                        296
#define SRLEN                         297
#define SRCON1                        298
#define SRRC1E                        299
#define SRRCKE                        300
#define SRRPE                         301
#define SRSC1E                        302
#define SRSCKE                        303
#define SRSPE                         304
#define APFCON                        305
#define CCP1SEL                       306
#define P1BSEL                        307
#define TXCKSEL                       308
#define T1GSEL                        309
#define SSSEL                         310
#define SS1SEL                        311
#define SDO1SEL                       312
#define SDOSEL                        313
#define RXDTSEL                       314
#define ANSA0                         315
#define ANSELA                        316
#define ANSA1                         317
#define ANSA2                         318
#define ANSA4                         319
#define EEADRL                        320
#define EEADRH                        321
#define EEDATL                        322
#define EEDATH                        323
#define EECON1                        324
#define RD                            325
#define WR                            326
#define WREN                          327
#define WRERR                         328
#define FREE                          329
#define LWLO                          330
#define CFGS                          331
#define EEPGD                         332
#define EECON2                        333
#define RCREG                         334
#define TXREG                         335
#define SP1BRGL                       336
#define SP1BRGH                       337
#define RCSTA                         338
#define RX9D                          339
#define OERR                          340
#define FERR                          341
#define ADDEN                         342
#define CREN                          343
#define SREN                          344
#define RX9                           345
#define SPEN                          346
#define TXSTA                         347
#define TX9D                          348
#define TRMT                          349
#define BRGH                          350
#define SENDB                         351
#define SYNC                          352
#define TXEN                          353
#define TX9                           354
#define CSRC                          355
#define BAUDCON                       356
#define ABDEN                         357
#define WUE                           358
#define BRG16                         359
#define SCKP                          360
#define RCIDL                         361
#define ABDOVF                        362
#define WPUA0                         363
#define WPUA                          364
#define WPUA1                         365
#define WPUA2                         366
#define WPUA3                         367
#define WPUA4                         368
#define WPUA5                         369
#define SSP1BUF                       370
#define SSPBUF                        371
#define SSP1ADD                       372
#define SSPADD                        373
#define SSP1MSK                       374
#define SSPMSK                        375
#define SSP1STAT                      376
#define BF                            377
#define UA                            378
#define R_nW                          379
#define S                             380
#define P                             381
#define D_nA                          382
#define CKE                           383
#define SMP                           384
#define SSP1CON1                      385
#define SSPM0                         386
#define SSPM                          387
#define SSPM1                         388
#define SSPM2                         389
#define SSPM3                         390
#define CKP                           391
#define SSPEN                         392
#define SSPOV                         393
#define WCOL                          394
#define SSP1CON2                      395
#define SEN                           396
#define RSEN                          397
#define PEN                           398
#define RCEN                          399
#define ACKEN                         400
#define ACKDT                         401
#define ACKSTAT                       402
#define GCEN                          403
#define SSP1CON3                      404
#define DHEN                          405
#define AHEN                          406
#define SBCDE                         407
#define SDAHT                         408
#define BOEN                          409
#define SCIE                          410
#define PCIE                          411
#define ACKTIM                        412
#define CCPR1L                        413
#define CCPR1H                        414
#define CCP1CON                       415
#define CCP1M0                        416
#define CCP1M                         417
#define CCP1M1                        418
#define CCP1M2                        419
#define CCP1M3                        420
#define DC1B                          421
#define DC1B0                         422
#define DC1B1                         423
#define P1M                           424
#define P1M0                          425
#define P1M1                          426
#define PWM1CON                       427
#define P1DC                          428
#define P1DC0                         429
#define P1DC1                         430
#define P1DC2                         431
#define P1DC3                         432
#define P1DC4                         433
#define P1DC5                         434
#define P1DC6                         435
#define P1RSEN                        436
#define PSS1BD                        437
#define PSS1BD0                       438
#define PSS1BD1                       439
#define PSS1AC                        440
#define PSS1AC0                       441
#define PSS1AC1                       442
#define CCP1AS                        443
#define CCP1AS0                       444
#define CCP1AS1                       445
#define CCP1AS2                       446
#define CCP1ASE                       447
#define PSTR1CON                      448
#define STR1A                         449
#define STR1B                         450
#define STR1C                         451
#define STR1D                         452
#define STR1SYNC                      453
#define IOCAP                         454
#define IOCAP0                        455
#define IOCAP1                        456
#define IOCAP2                        457
#define IOCAP3                        458
#define IOCAP4                        459
#define IOCAP5                        460
#define IOCAN0                        461
#define IOCAN                         462
#define IOCAN1                        463
#define IOCAN2                        464
#define IOCAN3                        465
#define IOCAN4                        466
#define IOCAN5                        467
#define IOCAF0                        468
#define IOCAF                         469
#define IOCAF1                        470
#define IOCAF2                        471
#define IOCAF3                        472
#define IOCAF4                        473
#define IOCAF5                        474
#define CLKRCON                       475
#define CLKRDIV                       476
#define CLKRDIV0                      477
#define CLKRDIV1                      478
#define CLKRDIV2                      479
#define CLKRDC                        480
#define CLKRDC0                       481
#define CLKRDC1                       482
#define CLKRSLR                       483
#define CLKROE                        484
#define CLKREN                        485
#define MDCON                         486
#define MDBIT                         487
#define MDCON_MDOUT                   488
#define MDOPOL                        489
#define MDSLR                         490
#define MDOE                          491
#define MDEN                          492
#define MDSRC                         493
#define MDMS0                         494
#define MDMS                          495
#define MDMS1                         496
#define MDMS2                         497
#define MDMS3                         498
#define MDMSODIS                      499
#define MDCARL                        500
#define MDCL0                         501
#define MDCL                          502
#define MDCL1                         503
#define MDCL2                         504
#define MDCL3                         505
#define MDCLSYNC                      506
#define MDCLPOL                       507
#define MDCLODIS                      508
#define MDCARH                        509
#define MDCH                          510
#define MDCH0                         511
#define MDCH1                         512
#define MDCH2                         513
#define MDCH3                         514
#define MDCHSYNC                      515
#define MDCHPOL                       516
#define MDCHODIS                      517
#define STATUS_SHAD                   518
#define C_SHAD                        519
#define DC_SHAD                       520
#define Z_SHAD                        521
#define WREG_SHAD                     522
#define BSR_SHAD                      523
#define PCLATH_SHAD                   524
#define FSR0L_SHAD                    525
#define FSR0H_SHAD                    526
#define FSR1L_SHAD                    527
#define FSR1H_SHAD                    528
#define STKPTR                        529
#define TOSL                          530
#define TOSH                          531

#endif // _PIC12F1822_H_
